TODOs.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-05-05 mar. 01:47 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>TODOs</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Firmin Martin">
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">TODOs</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb58b2af">1. <span class="todo TODO">TODO</span> TODO features</a></li>
<li><a href="#org11ad8ca">2. <span class="todo TODO">TODO</span> TODO tasks <code>[0%]</code></a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgb58b2af" class="outline-2">
<h2 id="orgb58b2af"><span class="section-number-2">1</span> <span class="todo TODO">TODO</span> TODO features</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Support VCS: git/svn/mercurial</li>
<li>Support showing page description on point</li>
<li>Support image gallery</li>
</ul>
</div>
</div>
<div id="outline-container-org11ad8ca" class="outline-2">
<h2 id="org11ad8ca"><span class="section-number-2">2</span> <span class="todo TODO">TODO</span> TODO tasks <code>[0%]</code></h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li class="trans"><code>[-]</code> Documentation <code>[0/1]</code>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Use org-glaux to write documentation. Ref. <a href="https://kitchingroup.cheme.cmu.edu/blog/2014/10/17/Generate-emacs-lisp-documentation/">Generate emacs-lisp documentation</a></li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> README.org <code>[0/2]</code>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Tips: LaTeX support <code>[0/2]</code>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Use <a href="https://orgmode.org/manual/Include-Files.html">#+INCLUDE</a> to include LaTeX <code>\newcommand</code></li>
<li class="off"><code>[&#xa0;]</code> html export environment &amp; <code>\newcommand</code></li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> Update gifs</li>
</ul></li>
<li class="trans"><code>[-]</code> Enhance navigation experience  <code>[0/1]</code>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Dead website link highlight (use <code>url-http-file-exists-p</code> and prepend
https if needed)</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> org-glaux's version of <code>org-export-dispatch</code>.</li>
<li class="off"><code>[&#xa0;]</code> Fix new page overwriting header if parent directories doesn't exist.</li>
<li class="off"><code>[&#xa0;]</code> Add copy/renaming/moving page/assets facility</li>
<li class="off"><code>[&#xa0;]</code> Consider <code>org-attach</code> before implementing download-related function.</li>
<li class="off"><code>[&#xa0;]</code> add <a href="https://www.gnu.org/software/emacs/manual/html_node/ert/index.html">ERT: Emacs Lisp Regression Testing</a>. Especially for all kind of function computing path.</li>
<li class="off"><code>[&#xa0;]</code> In all interactive functions: check if current buffer is under an org-glaux dir</li>
<li class="off"><code>[&#xa0;]</code> Add a function which display statistics of the wiki (e.g. counting empty files, big files, dead links number etc.)</li>
<li class="off"><code>[&#xa0;]</code> Provide lint function listing all break link and suggesting quick fix Ref. <a href="https://emacs.stackexchange.com/questions/5389/correcting-and-maintaining-org-mode-hyperlinks">correcting-and-maintaining-org-mode-hyperlinks</a></li>
<li class="off"><code>[&#xa0;]</code> Generate html file by comparing created time with org file (speedup)</li>
<li class="off"><code>[&#xa0;]</code> Replace <code>find-file</code> by <code>with-temp-buffer</code> + <code>insert-file-contents</code>. See <a href="https://emacs.stackexchange.com/questions/2868/whats-wrong-with-find-file-noselect">here</a>.</li>
<li class="off"><code>[&#xa0;]</code> Use <a href="https://gongzhitaao.org/orgcss/">https://gongzhitaao.org/orgcss/</a> as default css instead the default one.</li>
<li class="off"><code>[&#xa0;]</code> add custom group to exclude dirs and files for the backup.</li>
<li class="off"><code>[&#xa0;]</code> add link name in custom group as <code>org-pdftools</code> does.</li>
<li class="off"><code>[&#xa0;]</code> add this repo to MELPA
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> meet CONTRIBUTING requirements</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> provide key-map + minor-mode? (to make local keybindings possible)</li>
<li class="off"><code>[&#xa0;]</code> Extend <code>org-glaux--wiki-follow</code> to something like <code>:file</code> link. Ref. <code>org-link-open</code> and <a href="https://orgmode.org/manual/External-Links.html">External-links</a>. Support header searching.</li>
<li class="off"><code>[&#xa0;]</code> Bring a tag system.</li>
<li class="off"><code>[&#xa0;]</code> Use <code>index</code> as wiki settings file and <code>index/</code> as general assets directory</li>
</ul>
</div>
</div>
</div>
</body>
</html>
